app/views/feeds/index.html.erb

SELECT "feeds".* FROM "feeds"
---
<script type="application/json" id="bootstrapped_feeds_json">
  <%= Feed.all.to_json.html_safe %>