app/controllers/entries_controller.rb

  def index
    feed = Feed.find(params[:feed_id])
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", ":feed_id"]]