app/controllers/feeds_controller.rb

  def index
    respond_to do |format|
      format.html { render :index }
      format.json { render :json => Feed.all }
---
SELECT "feeds".* FROM "feeds"